org/The_speed_of_evolution_in_large_asexual_populations_by_Krug_et_al_in_2010.org
#+setupfile: ./hugo_setup.org
#+hugo_slug: The_speed_of_evolution_in_large_asexual_populations_by_Krug_et_al_in_2010
#+TITLE: The speed of evolution in large asexual populations by Krug et al in 2010
* Outline
** Introduction
** Models
*** Wright-Fisher model
*** Fitness landscapes and selection coefficients
** Infinite population dynamics
*** The evolution equation and its formal solution
*** General asymptotic behavior
*** Case studies
** Finite populations
*** Genetic drift, fixations and clonal interference
*** Model I: single selection coefficient of beneficial mutations
**** The Crow-Kimura-Felsenstein approach
**** The traveling wave approach
**** Comparison to simulations
*** Model II: continuous distribution of selection coefficients
**** Gerrish-Lenski theory
**** Asymptotic behavior of the GL theory
**** Importance of multiple mutations
** Summary and outlook
** Appendix: simulating the Wright-Fisher model
* See [[file:Joachim_Krug_ICTS_Lectures_June_2019.org][Joachim Krug ICTS Lectures June 2019]]
