content/posts/The_speed_of_evolution_in_large_asexual_populations_by_Krug_et_al_in_2010.md
+++
title = "The speed of evolution in large asexual populations by Krug et al in 2010"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:36:15-04:00
slug = "The_speed_of_evolution_in_large_asexual_populations_by_Krug_et_al_in_2010"
draft = false
+++

## Outline {#outline}


### Introduction {#introduction}


### Models {#models}

<!--list-separator-->

-  Wright-Fisher model

<!--list-separator-->

-  Fitness landscapes and selection coefficients


### Infinite population dynamics {#infinite-population-dynamics}

<!--list-separator-->

-  The evolution equation and its formal solution

<!--list-separator-->

-  General asymptotic behavior

<!--list-separator-->

-  Case studies


### Finite populations {#finite-populations}

<!--list-separator-->

-  Genetic drift, fixations and clonal interference

<!--list-separator-->

-  Model I: single selection coefficient of beneficial mutations

    <!--list-separator-->

    -  The Crow-Kimura-Felsenstein approach

    <!--list-separator-->

    -  The traveling wave approach

    <!--list-separator-->

    -  Comparison to simulations

<!--list-separator-->

-  Model II: continuous distribution of selection coefficients

    <!--list-separator-->

    -  Gerrish-Lenski theory

    <!--list-separator-->

    -  Asymptotic behavior of the GL theory

    <!--list-separator-->

    -  Importance of multiple mutations


### Summary and outlook {#summary-and-outlook}


### Appendix: simulating the Wright-Fisher model {#appendix-simulating-the-wright-fisher-model}


## See [Joachim Krug ICTS Lectures June 2019]({{< relref "Joachim_Krug_ICTS_Lectures_June_2019" >}}) {#see-joachim-krug-icts-lectures-june-2019--joachim-krug-icts-lectures-june-2019-dot-md}
